[
  {
    "id": 0,
    "picture": "https://d3lp4xedbqa8a5.cloudfront.net/s3/digital-cougar-assets/now/2019/05/29/1559101786676_TV2219RealityNews105.jpg?width=600&height=315&quality=75&mode=crop",
    "name": "Matt Preston",
    "bio": "Matt Preston is a food critic, chef, writer, and television personality. He is best known for his role as a judge on the cooking competition show MasterChef Australia.",
    "experience": "20 years",
    "numOfRecipes": 5,
    "likes": 412,
    "recipes": [
      {
        "name": "Moreton Bay Bug with Chips",
        "picture": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Jimmy%27s_On_the_Mall_seafood_dish_for_two.jpg/1920px-Jimmy%27s_On_the_Mall_seafood_dish_for_two.jpg",
        "ingredients": [
          "2 Moreton Bay bugs",
          "1 lemon",
          "2 tbsp olive oil",
          "Sea salt and freshly ground black pepper",
          "1 garlic clove, crushed",
          "1 large handful parsley, finely chopped",
          "1 small handful basil, finely chopped",
          "1 handful cherry tomatoes, halved",
          "2 handfuls of chips",
          "Mayonnaise, to serve"
        ],
        "cooking_method": "Preheat a BBQ or griddle pan to a high heat. Split the bugs in half, remove the stomach and wash the heads and tails under cold water. Drain and pat dry with a paper towel. Grate the lemon zest into a bowl, add the olive oil and season with salt and pepper. Brush this mixture over the bugs, garlic, parsley and basil. Grill the bugs on their backs for 5 minutes, then turn over and cook for another 2-3 minutes, until the flesh is pearly and cooked through. While the bugs are cooking, toss the chips in a little oil and salt and cook in the oven. Serve the bugs with chips, cherry tomatoes and mayonnaise.",
        "rating": 4.8
      },
      {
        "name": "Lamingtons",
        "picture": "https://www.anasbakingchronicles.com/wp-content/uploads/2019/08/Lamingtons-blog-3.jpg",
        "ingredients": [
          "225g unsalted butter, softened",
          "225g caster sugar",
          "4 eggs",
          "375g self-raising flour",
          "125ml milk",
          "200g desiccated coconut",
          "400g raspberry jam"
        ],
        "cooking_method": "Preheat the oven to 180C. Cream the butter and sugar together until light and fluffy. Beat in the eggs one at a time. Fold in the flour and milk. Spread the mixture evenly into a greased baking tin and bake for 30-35 minutes. Allow to cool, then cut into squares. Spread jam over one half of each square, then sandwich together with another half. Roll each sandwich in coconut to coat.",
        "rating": 4.5
      },
      {
        "name": "Pie Floater",
        "picture": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Pie_floater_in_Adelaide_SA.jpg",
        "ingredients": [
          "1 lb ground beef",
          "1 onion, finely chopped",
          "2 cloves garlic, minced",
          "2 tablespoons tomato paste",
          "1/2 cup beef broth",
          "1/2 cup red wine",
          "1 tablespoon Worcestershire sauce",
          "1 tablespoon cornstarch",
          "1 tablespoon water",
          "Salt and pepper",
          "4 meat pies",
          "1 can green peas",
          "Ketchup"
        ],
        "cooking_method": "In a large skillet, cook the ground beef over medium-high heat until browned, breaking it up into small pieces. Add the onion and garlic and cook until softened, about 5 minutes. Stir in the tomato paste, beef broth, red wine, Worcestershire sauce, salt, and pepper. Bring to a simmer and cook until the mixture has thickened slightly, about 10 minutes. In a small bowl, whisk together the cornstarch and water until smooth. Stir the cornstarch mixture into the beef mixture and continue to cook until the sauce has thickened, about 5 minutes. Preheat the oven to 350 degrees F. Place the meat pies on a baking sheet and bake for 10-15 minutes, until heated through. To assemble the pie floater, place a meat pie in the bottom of a bowl. Spoon some of the beef mixture over the top of the pie, then add a spoonful of green peas. Finish with a dollop of ketchup on top. Serve immediately.",
        "rating": 4.2
      }
    ]
  },
  {
    "id": 1,
    "picture": "https://images.squarespace-cdn.com/content/v1/5a5fdc4f32601ef5683847c2/1555985601854-RCTJHV3YZ4E712FRM38H/ke17ZwdGBToddI8pDm48kAJL34WgVyxuhaZNa7Z1p6R7gQa3H78H3Y0txjaiv_0fDoOvxcdMmMKkDsyUqMSsMWxHk725yiiHCCLfrh8O1z5QPOohDIaIeljMHgDF5CVlOqpeNLcJ80NK65_fV7S1UQ2k5JsM-5kwHbyto5xavrAsdbQSz0rvDjqe1LEAMxmcTi8HWjhfOMceW7FFMLdz1Q/9D1A1376_edited.jpg?format=original",
    "name": "Curtis Stone",
    "bio": "Curtis Stone is an Australian celebrity chef, author, and television personality. He has appeared on numerous cooking shows including Surfing the Menu, Top Chef Masters, and MasterChef Australia.",
    "experience": "15 years",
    "numOfRecipes": 6,
    "likes": 631,
    "recipes": [
      {
        "name": "Grilled Barramundi",
        "picture": "https://www.lifeasastrawberry.com/wp-content/uploads/2017/06/grilled-barramundi-8s.jpg",
        "ingredients": [
          "4 barramundi fillets",
          "1/4 cup olive oil",
          "2 garlic cloves, minced",
          "1 teaspoon dried oregano",
          "1 lemon, juiced",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat grill to medium-high heat. In a small bowl, whisk together olive oil, garlic, oregano, and lemon juice. Season barramundi fillets with salt and pepper, then brush both sides with the olive oil mixture. Grill the fillets for 3-4 minutes on each side, until cooked through. Serve hot with lemon wedges on the side.",
        "rating": 4.7
      },
      {
        "name": "Beef and Mushroom Pie",
        "picture": "https://img.taste.com.au/AL9xqu5d/w720-h480-cfill-q80/taste/2018/07/family-beef-and-mushroom-pie-139131-2.jpg",
        "ingredients": [
          "500g beef steak, diced",
          "1 onion, chopped",
          "2 garlic cloves, minced",
          "200g mushrooms, sliced",
          "2 tablespoons plain flour",
          "1 cup beef stock",
          "1 tablespoon tomato paste",
          "2 teaspoons Worcestershire sauce",
          "1 teaspoon dried thyme",
          "Salt and pepper",
          "1 sheet frozen puff pastry, thawed"
        ],
        "cooking_method": "Preheat oven to 200C. Heat some oil in a large saucepan over medium-high heat. Add the beef and cook for 5-7 minutes, until browned. Add the onion and garlic and cook for another 2-3 minutes. Add the mushrooms and cook for another 5 minutes. Stir in the flour and cook for 1-2 minutes. Gradually pour in the beef stock while stirring constantly. Add the tomato paste, Worcestershire sauce, and thyme, and season with salt and pepper. Simmer for 10 minutes, stirring occasionally. Pour the mixture into a pie dish and cover with the puff pastry sheet. Bake for 20-25 minutes, until golden brown.",
        "rating": 4.6
      },
      {
        "name": "Anzac Biscuits",
        "picture": "https://assets.bonappetit.com/photos/6075b61a154c806a8cee88ec/1:1/w_2240,c_limit/Go-Live-Anzac-Biscuits.jpg",
        "ingredients": [
          "1 cup rolled oats",
          "1 cup plain flour",
          "1 cup desiccated coconut",
          "3/4 cup brown sugar",
          "125g butter, chopped",
          "2 tablespoons golden syrup",
          "1 teaspoon bicarbonate of soda",
          "2 tablespoons boiling water"
        ],
        "cooking_method": "Preheat oven to 160C. Mix the oats, flour, coconut, and brown sugar in a bowl. Melt the butter and golden syrup together in a saucepan. Dissolve the bicarbonate of soda in boiling water and add to the saucepan. Pour the mixture into the bowl with the dry ingredients and mix well. Roll tablespoons of the mixture into balls and place them on a lined baking tray. Flatten them slightly with a fork. Bake for 15-20 minutes, until golden brown.",
        "rating": 4.4
      }
    ]
  },
  {
    "id": 2,
    "picture": "https://images-1d71.kxcdn.com/images/resized/size-misc_massive_sw/2013/07/12/06/18/06/055/maggie_9_nov_16__1_.jpg",
    "name": "Maggie Beer",
    "bio": "Maggie Beer is an Australian chef, author, and television personality. She is known for her love of cooking with fresh, seasonal ingredients and her passion for sharing her knowledge with others.",
    "experience": "30 years",
    "numOfRecipes": 7,
    "likes": 700,
    "recipes": [
      {
        "name": "Kangaroo Fillet with Red Wine Jus",
        "picture": "https://www.sbs.com.au/food/sites/sbs.com.au.food/files/og_ep1_kangaroo-with-red-wine-sauce.2jpg.jpg",
        "ingredients": [
          "4 kangaroo fillets",
          "1 tablespoon olive oil",
          "1 garlic clove, minced",
          "1 sprig rosemary, chopped",
          "1/2 cup red wine",
          "1/2 cup beef stock",
          "1 tablespoon butter"
        ],
        "cooking_method": "Heat the oil in a frying pan over high heat. Add the kangaroo fillets and cook for 3-4 minutes on each side, until cooked to your liking. Remove the fillets and keep warm. Add the garlic and rosemary to the pan and cook for 1-2 minutes. Pour in the red wine and beef stock and stir to combine. Simmer for 5-7 minutes, until the sauce has reduced and thickened. Remove from the heat and stir in the butter. Serve the kangaroo fillets with the red wine jus on the side.",
        "rating": 4.9
      },
      {
        "name": "Halal Snack Pack",
        "picture": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Hspchips_%28cropped%29.jpg/1920px-Hspchips_%28cropped%29.jpg",
        "ingredients": [
          "French fries",
          "Halal-certified kebab meat",
          "Garlic sauce",
          "Chili sauce",
          "BBQ sauce",
          "1/4 cup hummus",
          "1/4 cup tahini"
        ],
        "cooking_method": "Cook the French fries until crispy. Cook the kebab meat on a hot grill or in a skillet until fully cooked. Arrange the French fries on a plate and top with the kebab meat. Drizzle garlic and chili sauce over the top. Serve hot.",
        "rating": 4.2
      },
      {
        "name": "Pavlova",
        "picture": "https://emmaduckworthbakes.com/wp-content/uploads/2019/07/Christmas-Pavlova-Recipe.jpg",
        "ingredients": [
          "4 egg whites",
          "1 cup caster sugar",
          "1 teaspoon white vinegar",
          "1 teaspoon vanilla extract",
          "1 tablespoon cornflour",
          "300ml cream",
          "2 cups mixed berries"
        ],
        "cooking_method": "Preheat oven to 150C. Line a baking tray with baking paper. Beat the egg whites with an electric mixer until stiff peaks form. Gradually add the caster sugar, one tablespoon at a time, beating well after each addition, until the mixture is thick and glossy. Add the vinegar, vanilla extract, and cornflour and gently fold them in. Spoon the mixture onto the prepared baking tray and shape it into a circle. Make a small well in the center of the pavlova. Bake for 1 hour, until the pavlova is crisp on the outside and soft on the inside. Turn off the oven and let the pavlova cool in the oven with the door slightly ajar. Once cool, carefully transfer the pavlova to a serving platter. Whip the cream until it forms soft peaks and spoon it onto the pavlova. Top with mixed berries and serve immediately.",
        "rating": 4.9
      }
    ]
  },
  {
    "id": 3,
    "picture": "https://theweekendedition.com.au/wp-content/uploads/2019/10/TWE-Matt-Moran-1100x550-c-center.png",
    "name": "Matt Moran",
    "bio": "Matt Moran is an Australian chef, restaurateur, and television personality. He is the owner of several highly acclaimed restaurants in Sydney, including ARIA and Chiswick.",
    "experience": "16 years",
    "numOfRecipes": 5,
    "likes": 499,
    "recipes": [
      {
        "name": "Beef and Guinness Pie",
        "picture": "https://img.taste.com.au/I_boi8W4/w720-h480-cfill-q80/taste/2020/05/jun20_chunky-beef-guinness-pie-161701-1.jpg",
        "ingredients": [
          "1 kg beef chuck steak, cut into 3cm pieces",
          "2 tablespoons plain flour",
          "2 tablespoons olive oil",
          "2 brown onions, chopped",
          "2 garlic cloves, crushed",
          "2 tablespoons tomato paste",
          "1 tablespoon Worcestershire sauce",
          "1 1/2 cups Guinness beer",
          "2 cups beef stock",
          "2 bay leaves",
          "2 sprigs of fresh thyme",
          "2 sheets frozen shortcrust pastry, thawed",
          "2 sheets frozen puff pastry, thawed",
          "1 egg, lightly beaten",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat the oven to 180°C. Toss the beef with flour, salt, and pepper. Heat the oil in a large heavy-based saucepan over high heat. Add the beef and cook until browned on all sides. Add the onion and garlic and cook for a few minutes until softened. Add the tomato paste and Worcestershire sauce and cook for a few minutes until fragrant. Pour in the Guinness and beef stock, then add the bay leaves and thyme. Bring to a boil, then reduce the heat to low and simmer for 1 1/2 to 2 hours until the beef is tender and the sauce has thickened. Remove the bay leaves and thyme. Pour the beef mixture into a 2-liter pie dish. Cut a round from the shortcrust pastry and place it on top of the beef mixture. Cut a round from the puff pastry and place it on top of the shortcrust pastry. Brush with the beaten egg. Bake for 35 to 40 minutes or until the pastry is golden brown and puffed.",
        "rating": 4.6
      },
      {
        "name": "Barramundi Fish and Chips",
        "picture": "https://www.themeatclub.com.sg/wp-content/uploads/2021/06/10.jpg",
        "ingredients": [
          "500g firm white fish fillets, such as ling or barramundi",
          "1 cup plain flour",
          "1 teaspoon baking powder",
          "1 cup beer",
          "1 tablespoon olive oil",
          "1kg potatoes, peeled and cut into thick chips",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat the oven to 200°C. Place the potato chips onto a baking tray, drizzle with olive oil and season with salt and pepper. Bake for 40 minutes or until golden brown and crispy. Meanwhile, prepare the batter by whisking together the flour, baking powder, beer, and olive oil. Season with salt and pepper. Dip the fish fillets into the batter and deep-fry in hot oil until golden brown and cooked through. Drain on paper towels. Serve with the chips.",
        "rating": 4.5
      },
      {
        "name": "Aussie Beef Pie",
        "picture": "https://gdaygourmet.com/wp-content/uploads/2021/07/Aussie-meat-pie.jpg",
        "ingredients": [
          "500g beef chuck steak, cut into small pieces",
          "1 onion, chopped",
          "2 garlic cloves, minced",
          "200g mushrooms, sliced",
          "2 tablespoons tomato paste",
          "2 cups beef stock",
          "2 tablespoons olive oil",
          "Salt and pepper",
          "500g store-bought puff pastry"
        ],
        "cooking_method": "Preheat the oven to 200°C. Heat the olive oil in a large saucepan over medium-high heat. Add the beef and cook for 5 minutes or until browned. Add the onion and garlic and cook for a further 2 minutes. Add the mushrooms and tomato paste and cook for 5 minutes. Add the beef stock and bring to a simmer. Simmer for 1 hour or until the beef is tender and the sauce has thickened. Season with salt and pepper. Spoon the beef mixture into a large baking dish. Cover with puff pastry and bake for 20-25 minutes or until the pastry is golden brown and puffed up. Serve hot.",
        "rating": 4.6
      }
    ]
  },
  {
    "id": 4,
    "picture": "https://i.natgeofe.com/n/8fb4c7a9-4479-467d-ada5-144a7300c072/neil-perry-chef-sydney-590.jpg?w=1272&h=848",
    "name": "Neil Perry",
    "bio": "Neil Perry is an Australian chef and restaurateur. He is the founder of the Rockpool Dining Group and has received numerous awards for his contributions to the culinary industry.",
    "experience": "35 years",
    "numOfRecipes": 12,
    "likes": 223,
    "recipes": [
      {
        "name": "Grilled Barramundi with Salsa Verde",
        "picture": "https://media.blueapron.com/recipes/21589/square_newsletter_images/1552404241-422-0032-6470/0415_W4_Barramundi_1559_Square.jpg?quality=80&width=850&format=pjpg",
        "ingredients": [
          "4 barramundi fillets",
          "1/4 cup olive oil",
          "1/4 cup chopped fresh parsley",
          "2 tablespoons capers, rinsed and drained",
          "2 tablespoons chopped fresh basil",
          "Salt and pepper"
        ],
        "cooking_method": "Heat a grill pan over high heat. Brush the barramundi fillets with olive oil and season with salt and pepper. Grill the fillets for 2-3 minutes on each side, until cooked through. In a small bowl, mix the parsley, capers, basil, and olive oil. Serve the grilled barramundi with the salsa verde.",
        "rating": 4.8
      },
      {
        "name": "Smashed Avo",
        "picture": "https://upload.wikimedia.org/wikipedia/commons/f/fa/Avocado_Toast_Melbourne_%28cropped%29.jpg",
        "ingredients": [
          "2 ripe avocados",
          "1 lime, juiced",
          "1/2 teaspoon salt",
          "1/4 teaspoon ground black pepper",
          "1/2 small red onion, finely chopped",
          "1 small red chili, seeded and finely chopped",
          "1 tablespoon chopped fresh cilantro",
          "2 slices sourdough bread, toasted",
          "1 tablespoon olive oil",
          "2 eggs, poached"
        ],
        "cooking_method": "Cut the avocados in half, remove the pits, and scoop the flesh into a bowl. Add the lime juice, salt, and pepper, and mash with a fork. Stir in the red onion, chili, and cilantro. Drizzle the toasted bread with olive oil and top each slice with half of the avocado mixture. Top each with a poached egg and serve immediately.",
        "rating": 4.5
      },
      {
        "name": "Chicken Parmigiana",
        "picture": "https://upload.wikimedia.org/wikipedia/commons/1/12/Chicken_parmigiana.jpg",
        "ingredients": [
          "4 chicken breasts",
          "1/2 cup all-purpose flour",
          "1/2 teaspoon garlic powder",
          "1/2 teaspoon dried oregano",
          "1/4 teaspoon salt",
          "1/4 teaspoon black pepper",
          "2 eggs",
          "1 cup Italian-seasoned breadcrumbs",
          "1 cup tomato sauce",
          "1 cup shredded mozzarella cheese",
          "1/4 cup grated Parmesan cheese",
          "2 tablespoons olive oil"
        ],
        "cooking_method": "Preheat the oven to 190°C. Pound the chicken breasts until they are even in thickness. In a shallow dish, mix together the flour, garlic powder, oregano, salt, and pepper. In another shallow dish, whisk the eggs. In a third shallow dish, place the breadcrumbs. Dip each chicken breast first in the flour mixture, shaking off the excess, then in the egg mixture, and finally in the breadcrumbs. Heat the olive oil in a large skillet over medium-high heat. Add the chicken breasts and cook until browned, about 3 minutes per side. Remove from heat. Spread the tomato sauce over the chicken, then sprinkle with the mozzarella and Parmesan cheeses. Transfer the skillet to the oven and bake for 20-25 minutes, or until the cheese is melted and bubbly. Let cool slightly before serving.",
        "rating": 4.6
      }
    ]
  },
  {
    "id": 5,
    "picture": "https://i.dailymail.co.uk/1s/2021/06/03/12/43784757-9647939-image-a-86_1622718880203.jpg",
    "name": "Shannon Bennett",
    "bio": "Shannon Bennett is an Australian chef and restaurateur. He is the owner of several highly acclaimed restaurants in Melbourne, including Vue de monde and Jardin Tan.",
    "experience": "22 years",
    "numOfRecipes": 8,
    "likes": 380,
    "recipes": [
      {
        "name": "Slow-cooked Kangaroo Steak",
        "picture": "https://www.nospoonnecessary.com/wp-content/uploads/2018/03/Slow-Cooker-Beef-Brisket-51.jpg",
        "ingredients": [
          "1 kangaroo brisket (3-4 pounds)",
          "1 onion, chopped",
          "4 cloves garlic, minced",
          "2 cups kangaroo broth",
          "1 cup red wine",
          "1 tablespoon paprika",
          "1 tablespoon cumin",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat oven to 325 degrees F. In a large Dutch oven, heat a tablespoon of oil over medium-high heat. Add the brisket and cook until browned on all sides, about 10 minutes. Remove from the pot and set aside. Add the onion and garlic to the pot and cook until softened, about 5 minutes. Add the broth, wine, paprika, cumin, salt, and pepper. Bring to a boil. Return the brisket to the pot, cover, and transfer to the oven. Cook for 3-4 hours, until the meat is tender and falls apart easily. Remove from the oven and let rest for 10-15 minutes before slicing.",
        "rating": 4.6
      },
      {
        "name": "Confit of Tasmanian Ocean Trout",
        "picture": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Tetsuyas-Ocean-Trout.jpg/2560px-Tetsuyas-Ocean-Trout.jpg",
        "ingredients": [
          "1 lb Tasmanian ocean trout fillet",
          "1/2 cup extra-virgin olive oil",
          "1/2 cup kosher salt",
          "2 tablespoons honey",
          "2 tablespoons fresh lemon juice",
          "1 teaspoon freshly ground black pepper",
          "1 bunch fresh dill"
        ],
        "cooking_method": "Preheat the oven to 200°C. Line a baking tray with baking paper. Rinse the fish fillet under cold water and pat dry with paper towels. In a mixing bowl, combine the olive oil, salt, honey, lemon juice and black pepper. Add the dill and stir well. Spread the mixture over the fish, pressing it down to make sure it adheres. Cover with plastic wrap and marinate in the refrigerator for at least 6 hours. Remove the plastic wrap and transfer the fish to the prepared baking tray. Bake for 10-15 minutes, or until cooked through. Let cool slightly before serving.",
        "rating": 4.8
      },
      {
        "name": "Roast Lamb with Rosemary and Garlic",
        "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F19%2F2003%2F10%2F17%2FMyRecipes_RoastLambwithRosemaryandGarlic_99-2000.jpg&q=60",
        "ingredients": [
          "1 leg of lamb, bone-in",
          "6 cloves garlic, minced",
          "2 tablespoons fresh rosemary leaves, chopped",
          "2 tablespoons olive oil",
          "1/2 cup grated butter",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat oven to 425 degrees F. In a small bowl, mix together the garlic, rosemary, olive oil, salt, and pepper. Rub the mixture onto the lamb. Place the lamb in a roasting pan and roast for 15 minutes. Reduce heat to 350 degrees F and continue roasting for another 1-1.5 hours, until the internal temperature reaches 135 degrees F for medium-rare. Remove from the oven and let rest for 15-20 minutes before slicing.",
        "rating": 4.7
      }
    ]
  }
]
