[
  {
    "id": 1,
    "picture": "https://d3lp4xedbqa8a5.cloudfront.net/s3/digital-cougar-assets/now/2019/05/29/1559101786676_TV2219RealityNews105.jpg?width=600&height=315&quality=75&mode=crop",
    "name": "Matt Preston",
    "experience": "20 years",
    "numOfRecipes": 5,
    "likes": 500,
    "recipes": [
      {
        "name": "Lamb Roast",
        "ingredients": [
          "1 leg of lamb",
          "4 garlic cloves, peeled",
          "6 fresh rosemary sprigs",
          "1kg potatoes, peeled and chopped into chunks",
          "500g carrots, peeled and chopped into chunks",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat the oven to 180C. Make small incisions all over the lamb and insert a piece of garlic and a small sprig of rosemary into each. Season with salt and pepper. Place the lamb in a roasting tray and roast for 1 hour. Add the potatoes and carrots to the tray and roast for another 30 minutes.",
        "rating": 4.8
      },
      {
        "name": "Lamingtons",
        "ingredients": [
          "225g unsalted butter, softened",
          "225g caster sugar",
          "4 eggs",
          "375g self-raising flour",
          "125ml milk",
          "200g desiccated coconut",
          "400g raspberry jam"
        ],
        "cooking_method": "Preheat the oven to 180C. Cream the butter and sugar together until light and fluffy. Beat in the eggs one at a time. Fold in the flour and milk. Spread the mixture evenly into a greased baking tin and bake for 30-35 minutes. Allow to cool, then cut into squares. Spread jam over one half of each square, then sandwich together with another half. Roll each sandwich in coconut to coat.",
        "rating": 4.5
      },
      {
        "name": "Chicken and Corn Soup",
        "ingredients": [
          "2 chicken breasts, shredded",
          "2 tablespoons vegetable oil",
          "1 onion, chopped",
          "1 garlic clove, minced",
          "2 cups chicken stock",
          "2 cups frozen corn",
          "2 eggs, beaten",
          "2 tablespoons soy sauce",
          "1 teaspoon sesame oil",
          "2 spring onions, thinly sliced"
        ],
        "cooking_method": "Heat the oil in a large saucepan over medium-high heat. Add the onion and garlic and cook for 2-3 minutes, until softened. Add the chicken stock and corn and bring to the boil. Reduce heat and simmer for 5 minutes. Add the shredded chicken, soy sauce, and sesame oil and cook for another 2-3 minutes. Slowly pour in the beaten eggs while stirring the soup. Serve hot, garnished with sliced spring onions.",
        "rating": 4.2
      }
    ]
  },
  {
    "id": 2,
    "picture": "https://images.squarespace-cdn.com/content/v1/5a5fdc4f32601ef5683847c2/1555985601854-RCTJHV3YZ4E712FRM38H/ke17ZwdGBToddI8pDm48kAJL34WgVyxuhaZNa7Z1p6R7gQa3H78H3Y0txjaiv_0fDoOvxcdMmMKkDsyUqMSsMWxHk725yiiHCCLfrh8O1z5QPOohDIaIeljMHgDF5CVlOqpeNLcJ80NK65_fV7S1UQ2k5JsM-5kwHbyto5xavrAsdbQSz0rvDjqe1LEAMxmcTi8HWjhfOMceW7FFMLdz1Q/9D1A1376_edited.jpg?format=original",
    "name": "Curtis Stone",
    "experience": "15 years",
    "numOfRecipes": 6,
    "likes": 600,
    "recipes": [
      {
        "name": "Grilled Barramundi",
        "ingredients": [
          "4 barramundi fillets",
          "1/4 cup olive oil",
          "2 garlic cloves, minced",
          "1 teaspoon dried oregano",
          "1 lemon, juiced",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat grill to medium-high heat. In a small bowl, whisk together olive oil, garlic, oregano, and lemon juice. Season barramundi fillets with salt and pepper, then brush both sides with the olive oil mixture. Grill the fillets for 3-4 minutes on each side, until cooked through. Serve hot with lemon wedges on the side.",
        "rating": 4.7
      },
      {
        "name": "Beef and Mushroom Pie",
        "ingredients": [
          "500g beef steak, diced",
          "1 onion, chopped",
          "2 garlic cloves, minced",
          "200g mushrooms, sliced",
          "2 tablespoons plain flour",
          "1 cup beef stock",
          "1 tablespoon tomato paste",
          "2 teaspoons Worcestershire sauce",
          "1 teaspoon dried thyme",
          "Salt and pepper",
          "1 sheet frozen puff pastry, thawed"
        ],
        "cooking_method": "Preheat oven to 200C. Heat some oil in a large saucepan over medium-high heat. Add the beef and cook for 5-7 minutes, until browned. Add the onion and garlic and cook for another 2-3 minutes. Add the mushrooms and cook for another 5 minutes. Stir in the flour and cook for 1-2 minutes. Gradually pour in the beef stock while stirring constantly. Add the tomato paste, Worcestershire sauce, and thyme, and season with salt and pepper. Simmer for 10 minutes, stirring occasionally. Pour the mixture into a pie dish and cover with the puff pastry sheet. Bake for 20-25 minutes, until golden brown.",
        "rating": 4.6
      },
      {
        "name": "Anzac Biscuits",
        "ingredients": [
          "1 cup rolled oats",
          "1 cup plain flour",
          "1 cup desiccated coconut",
          "3/4 cup brown sugar",
          "125g butter, chopped",
          "2 tablespoons golden syrup",
          "1 teaspoon bicarbonate of soda",
          "2 tablespoons boiling water"
        ],
        "cooking_method": "Preheat oven to 160C. Mix the oats, flour, coconut, and brown sugar in a bowl. Melt the butter and golden syrup together in a saucepan. Dissolve the bicarbonate of soda in boiling water and add to the saucepan. Pour the mixture into the bowl with the dry ingredients and mix well. Roll tablespoons of the mixture into balls and place them on a lined baking tray. Flatten them slightly with a fork. Bake for 15-20 minutes, until golden brown.",
        "rating": 4.4
      }
    ]
  },
  {
    "id": 3,
    "picture": "https://images-1d71.kxcdn.com/images/resized/size-misc_massive_sw/2013/07/12/06/18/06/055/maggie_9_nov_16__1_.jpg",
    "name": "Maggie Beer",
    "experience": "30 years",
    "numOfRecipes": 7,
    "likes": 700,
    "recipes": [
      {
        "name": "Kangaroo Fillet with Red Wine Jus",
        "ingredients": [
          "4 kangaroo fillets",
          "1 tablespoon olive oil",
          "1 garlic clove, minced",
          "1 sprig rosemary, chopped",
          "1/2 cup red wine",
          "1/2 cup beef stock",
          "1 tablespoon butter"
        ],
        "cooking_method": "Heat the oil in a frying pan over high heat. Add the kangaroo fillets and cook for 3-4 minutes on each side, until cooked to your liking. Remove the fillets and keep warm. Add the garlic and rosemary to the pan and cook for 1-2 minutes. Pour in the red wine and beef stock and stir to combine. Simmer for 5-7 minutes, until the sauce has reduced and thickened. Remove from the heat and stir in the butter. Serve the kangaroo fillets with the red wine jus on the side.",
        "rating": 4.9
      },
      {
        "name": "Quince and Almond Tart",
        "ingredients": [
          "1 sheet frozen shortcrust pastry, thawed",
          "3 quinces, peeled, cored, and thinly sliced",
          "1/2 cup caster sugar",
          "1/2 cup almond meal",
          "1/2 cup cream",
          "2 eggs",
          "1/2 teaspoon vanilla extract"
        ],
        "cooking_method": "Preheat oven to 180C. Line a tart tin with the shortcrust pastry. Arrange the sliced quinces on top of the pastry. Sprinkle the caster sugar over the quinces. Mix the almond meal, cream, eggs, and vanilla extract in a bowl. Pour the mixture over the quinces. Bake for 35-40 minutes, until the filling is set and golden brown. Let cool before serving.",
        "rating": 4.8
      },
      {
        "name": "Pavlova",
        "ingredients": [
          "4 egg whites",
          "1 cup caster sugar",
          "1 teaspoon white vinegar",
          "1 teaspoon vanilla extract",
          "1 tablespoon cornflour",
          "300ml cream",
          "2 cups mixed berries"
        ],
        "cooking_method": "Preheat oven to 150C. Line a baking tray with baking paper. Beat the egg whites with an electric mixer until stiff peaks form. Gradually add the caster sugar, one tablespoon at a time, beating well after each addition, until the mixture is thick and glossy. Add the vinegar, vanilla extract, and cornflour and gently fold them in. Spoon the mixture onto the prepared baking tray and shape it into a circle. Make a small well in the center of the pavlova. Bake for 1 hour, until the pavlova is crisp on the outside and soft on the inside. Turn off the oven and let the pavlova cool in the oven with the door slightly ajar. Once cool, carefully transfer the pavlova to a serving platter. Whip the cream until it forms soft peaks and spoon it onto the pavlova. Top with mixed berries and serve immediately.",
        "rating": 4.6
      }
    ]
  },
  {
    "id": 4,
    "picture": "https://theweekendedition.com.au/wp-content/uploads/2019/10/TWE-Matt-Moran-1100x550-c-center.png",
    "name": "Matt Moran",
    "experience": "16 years",
    "numOfRecipes": 5,
    "likes": 5000,
    "recipes": [
      {
        "name": "Beef and Guinness Pie",
        "ingredients": [
          "1 kg beef chuck steak, cut into 3cm pieces",
          "2 tablespoons plain flour",
          "2 tablespoons olive oil",
          "2 brown onions, chopped",
          "2 garlic cloves, crushed",
          "2 tablespoons tomato paste",
          "1 tablespoon Worcestershire sauce",
          "1 1/2 cups Guinness beer",
          "2 cups beef stock",
          "2 bay leaves",
          "2 sprigs of fresh thyme",
          "2 sheets frozen shortcrust pastry, thawed",
          "2 sheets frozen puff pastry, thawed",
          "1 egg, lightly beaten",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat the oven to 180°C. Toss the beef with flour, salt, and pepper. Heat the oil in a large heavy-based saucepan over high heat. Add the beef and cook until browned on all sides. Add the onion and garlic and cook for a few minutes until softened. Add the tomato paste and Worcestershire sauce and cook for a few minutes until fragrant. Pour in the Guinness and beef stock, then add the bay leaves and thyme. Bring to a boil, then reduce the heat to low and simmer for 1 1/2 to 2 hours until the beef is tender and the sauce has thickened. Remove the bay leaves and thyme. Pour the beef mixture into a 2-liter pie dish. Cut a round from the shortcrust pastry and place it on top of the beef mixture. Cut a round from the puff pastry and place it on top of the shortcrust pastry. Brush with the beaten egg. Bake for 35 to 40 minutes or until the pastry is golden brown and puffed.",
        "rating": 4.6
      },
      {
        "name": "Fish and Chips",
        "ingredients": [
          "500g firm white fish fillets, such as ling or barramundi",
          "1 cup plain flour",
          "1 teaspoon baking powder",
          "1 cup beer",
          "1 tablespoon olive oil",
          "1kg potatoes, peeled and cut into thick chips",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat the oven to 200°C. Place the potato chips onto a baking tray, drizzle with olive oil and season with salt and pepper. Bake for 40 minutes or until golden brown and crispy. Meanwhile, prepare the batter by whisking together the flour, baking powder, beer, and olive oil. Season with salt and pepper. Dip the fish fillets into the batter and deep-fry in hot oil until golden brown and cooked through. Drain on paper towels. Serve with the chips.",
        "rating": 4.5
      },
      {
        "name": "Beef and Mushroom Pie",
        "ingredients": [
          "500g beef chuck steak, cut into small pieces",
          "1 onion, chopped",
          "2 garlic cloves, minced",
          "200g mushrooms, sliced",
          "2 tablespoons tomato paste",
          "2 cups beef stock",
          "2 tablespoons olive oil",
          "Salt and pepper",
          "500g store-bought puff pastry"
        ],
        "cooking_method": "Preheat the oven to 200°C. Heat the olive oil in a large saucepan over medium-high heat. Add the beef and cook for 5 minutes or until browned. Add the onion and garlic and cook for a further 2 minutes. Add the mushrooms and tomato paste and cook for 5 minutes. Add the beef stock and bring to a simmer. Simmer for 1 hour or until the beef is tender and the sauce has thickened. Season with salt and pepper. Spoon the beef mixture into a large baking dish. Cover with puff pastry and bake for 20-25 minutes or until the pastry is golden brown and puffed up. Serve hot.",
        "rating": 4.6
      }
    ]
  },
  {
    "id": 5,
    "picture": "https://i.natgeofe.com/n/8fb4c7a9-4479-467d-ada5-144a7300c072/neil-perry-chef-sydney-590.jpg?w=1272&h=848",
    "name": "Neil Perry",
    "experience": "35 years",
    "numOfRecipes": 12,
    "likes": 12000,
    "recipes": [
      {
        "name": "Grilled Barramundi with Salsa Verde",
        "ingredients": [
          "4 barramundi fillets",
          "1/4 cup olive oil",
          "1/4 cup chopped fresh parsley",
          "2 tablespoons capers, rinsed and drained",
          "2 tablespoons chopped fresh basil",
          "Salt and pepper"
        ],
        "cooking_method": "Heat a grill pan over high heat. Brush the barramundi fillets with olive oil and season with salt and pepper. Grill the fillets for 2-3 minutes on each side, until cooked through. In a small bowl, mix the parsley, capers, basil, and olive oil. Serve the grilled barramundi with the salsa verde.",
        "rating": 4.8
      },
      {
        "name": "Prawn and Mango Salad",
        "ingredients": [
          "1 kg cooked prawns, peeled and deveined",
          "2 mangoes, peeled and diced",
          "1/2 cup chopped fresh cilantro",
          "2 tablespoons lime juice",
          "2 tablespoons olive oil",
          "Salt and pepper"
        ],
        "cooking_method": "In a large bowl, mix the prawns, mangoes, and cilantro. In a small bowl, whisk the lime juice and olive oil together. Pour the dressing over the prawn and mango mixture and toss to combine. Serve immediately.",
        "rating": 4.5
      },
      {
        "name": "Beef Rendang",
        "ingredients": [
          "1 kg beef chuck roast, cut into 2-inch cubes",
          "2 cups coconut milk",
          "1/4 cup tamarind paste",
          "1 cinnamon stick",
          "6 kaffir lime leaves",
          "1/2 cup chopped fresh basil",
          "Salt and pepper"
        ],
        "cooking_method": "In a large pot, combine the beef, coconut milk, tamarind paste, cinnamon stick, and kaffir lime leaves. Bring to a boil over high heat. Reduce the heat to low and simmer for 2-3 hours, until the beef is tender and the sauce is thickened. Serve with rice.",
        "rating": 4.7
      }
    ]
  },
  {
    "id": 6,
    "picture": "https://i.dailymail.co.uk/1s/2021/06/03/12/43784757-9647939-image-a-86_1622718880203.jpg",
    "name": "Shannon Bennett",
    "experience": "22 years",
    "numOfRecipes": 8,
    "likes": 3800,
    "recipes": [
      {
        "name": "Slow-cooked Beef Brisket",
        "ingredients": [
          "1 beef brisket (3-4 pounds)",
          "1 onion, chopped",
          "4 cloves garlic, minced",
          "2 cups beef broth",
          "1 cup red wine",
          "1 tablespoon paprika",
          "1 tablespoon cumin",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat oven to 325 degrees F. In a large Dutch oven, heat a tablespoon of oil over medium-high heat. Add the brisket and cook until browned on all sides, about 10 minutes. Remove from the pot and set aside. Add the onion and garlic to the pot and cook until softened, about 5 minutes. Add the broth, wine, paprika, cumin, salt, and pepper. Bring to a boil. Return the brisket to the pot, cover, and transfer to the oven. Cook for 3-4 hours, until the meat is tender and falls apart easily. Remove from the oven and let rest for 10-15 minutes before slicing.",
        "rating": 4.6
      },
      {
        "name": "Pumpkin and Ricotta Lasagna",
        "ingredients": [
          "2 lbs pumpkin, peeled and cut into small cubes",
          "1 lb ricotta cheese",
          "1 onion, finely chopped",
          "4 cloves garlic, minced",
          "2 tablespoons olive oil",
          "1/2 cup grated Parmesan cheese",
          "1/2 cup chopped fresh basil",
          "Salt and pepper",
          "12 lasagna noodles, cooked"
        ],
        "cooking_method": "Preheat oven to 375 degrees F. In a large skillet, heat the oil over medium heat. Add the onion and garlic and cook until softened, about 5 minutes. Add the pumpkin and cook until tender, about 10 minutes. Remove from heat and let cool slightly. In a medium bowl, mix together the ricotta cheese, Parmesan cheese, basil, salt, and pepper. In a 9x13-inch baking dish, layer the lasagna noodles, pumpkin mixture, and ricotta mixture, repeating until all ingredients are used up. Bake for 35-40 minutes, until the top is golden brown and bubbly. Let cool for 10-15 minutes before serving.",
        "rating": 4.4
      },
      {
        "name": "Roast Lamb with Rosemary and Garlic",
        "ingredients": [
          "1 leg of lamb, bone-in",
          "6 cloves garlic, minced",
          "2 tablespoons fresh rosemary leaves, chopped",
          "2 tablespoons olive oil",
          "1/2 cup grated butter",
          "Salt and pepper"
        ],
        "cooking_method": "Preheat oven to 425 degrees F. In a small bowl, mix together the garlic, rosemary, olive oil, salt, and pepper. Rub the mixture onto the lamb. Place the lamb in a roasting pan and roast for 15 minutes. Reduce heat to 350 degrees F and continue roasting for another 1-1.5 hours, until the internal temperature reaches 135 degrees F for medium-rare. Remove from the oven and let rest for 15-20 minutes before slicing.",
        "rating": 4.7
      }
    ]
  }
]
