[
  {
    "name": "Chicken Parmigiana",
    "picture": "https://upload.wikimedia.org/wikipedia/commons/1/12/Chicken_parmigiana.jpg",
    "ingredients": [
      "4 chicken breasts",
      "1/2 cup all-purpose flour",
      "1/2 teaspoon garlic powder",
      "1/2 teaspoon dried oregano",
      "1/4 teaspoon salt",
      "1/4 teaspoon black pepper",
      "2 eggs",
      "1 cup Italian-seasoned breadcrumbs",
      "1 cup tomato sauce",
      "1 cup shredded mozzarella cheese",
      "1/4 cup grated Parmesan cheese",
      "2 tablespoons olive oil"
    ],
    "cooking_method": "Preheat the oven to 190°C. Pound the chicken breasts until they are even in thickness. In a shallow dish, mix together the flour, garlic powder, oregano, salt, and pepper. In another shallow dish, whisk the eggs. In a third shallow dish, place the breadcrumbs. Dip each chicken breast first in the flour mixture, shaking off the excess, then in the egg mixture, and finally in the breadcrumbs. Heat the olive oil in a large skillet over medium-high heat. Add the chicken breasts and cook until browned, about 3 minutes per side. Remove from heat. Spread the tomato sauce over the chicken, then sprinkle with the mozzarella and Parmesan cheeses. Transfer the skillet to the oven and bake for 20-25 minutes, or until the cheese is melted and bubbly. Let cool slightly before serving.",
    "rating": 4.6
  },
  {
    "name": "Moreton Bay Bug with Chips",
    "picture": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Jimmy%27s_On_the_Mall_seafood_dish_for_two.jpg/1920px-Jimmy%27s_On_the_Mall_seafood_dish_for_two.jpg",
    "ingredients": [
      "2 Moreton Bay bugs",
      "1 lemon",
      "2 tbsp olive oil",
      "Sea salt and freshly ground black pepper",
      "1 garlic clove, crushed",
      "1 large handful parsley, finely chopped",
      "1 small handful basil, finely chopped",
      "1 handful cherry tomatoes, halved",
      "2 handfuls of chips",
      "Mayonnaise, to serve"
    ],
    "cooking_method": "Preheat a BBQ or griddle pan to a high heat. Split the bugs in half, remove the stomach and wash the heads and tails under cold water. Drain and pat dry with a paper towel. Grate the lemon zest into a bowl, add the olive oil and season with salt and pepper. Brush this mixture over the bugs, garlic, parsley and basil. Grill the bugs on their backs for 5 minutes, then turn over and cook for another 2-3 minutes, until the flesh is pearly and cooked through. While the bugs are cooking, toss the chips in a little oil and salt and cook in the oven. Serve the bugs with chips, cherry tomatoes and mayonnaise.",
    "rating": 4.8
  },
  {
    "name": "Grilled Barramundi",
    "picture": "https://www.lifeasastrawberry.com/wp-content/uploads/2017/06/grilled-barramundi-8s.jpg",
    "ingredients": [
      "4 barramundi fillets",
      "1/4 cup olive oil",
      "2 garlic cloves, minced",
      "1 teaspoon dried oregano",
      "1 lemon, juiced",
      "Salt and pepper"
    ],
    "cooking_method": "Preheat grill to medium-high heat. In a small bowl, whisk together olive oil, garlic, oregano, and lemon juice. Season barramundi fillets with salt and pepper, then brush both sides with the olive oil mixture. Grill the fillets for 3-4 minutes on each side, until cooked through. Serve hot with lemon wedges on the side.",
    "rating": 4.7
  },
  {
    "name": "Pavlova",
    "picture": "https://emmaduckworthbakes.com/wp-content/uploads/2019/07/Christmas-Pavlova-Recipe.jpg",
    "ingredients": [
      "4 egg whites",
      "1 cup caster sugar",
      "1 teaspoon white vinegar",
      "1 teaspoon vanilla extract",
      "1 tablespoon cornflour",
      "300ml cream",
      "2 cups mixed berries"
    ],
    "cooking_method": "Preheat oven to 150C. Line a baking tray with baking paper. Beat the egg whites with an electric mixer until stiff peaks form. Gradually add the caster sugar, one tablespoon at a time, beating well after each addition, until the mixture is thick and glossy. Add the vinegar, vanilla extract, and cornflour and gently fold them in. Spoon the mixture onto the prepared baking tray and shape it into a circle. Make a small well in the center of the pavlova. Bake for 1 hour, until the pavlova is crisp on the outside and soft on the inside. Turn off the oven and let the pavlova cool in the oven with the door slightly ajar. Once cool, carefully transfer the pavlova to a serving platter. Whip the cream until it forms soft peaks and spoon it onto the pavlova. Top with mixed berries and serve immediately.",
    "rating": 4.9
  }
]
